In [1]:
import pandas as pd
import datetime
from datetime import timedelta, date

In [2]:
ID = [1,2,3]
Fullname = ["Stan Smith", "Nikola Griffin","Ruby Moore"]
Gender = ["Male","Male","Female"]
DateOfBirth = [date(1960,2,10), date(1999,12,20), date(2002,3,3)]

In [3]:
data = {
    "ID" : ID,
    "FullName" : Fullname,
    "Gender" : Gender,
    "DateOfBirth" : DateOfBirth
}
data

{'DateOfBirth': [datetime.date(1960, 2, 10),
  datetime.date(1999, 12, 20),
  datetime.date(2002, 3, 3)],
 'FullName': ['Stan Smith', 'Nikola Griffin', 'Ruby Moore'],
 'Gender': ['Male', 'Male', 'Female'],
 'ID': [1, 2, 3]}

In [4]:
df = pd.DataFrame(data)
df

   ID        FullName  Gender DateOfBirth
0   1      Stan Smith    Male  1960-02-10
1   2  Nikola Griffin    Male  1999-12-20
2   3      Ruby Moore  Female  2002-03-03

In [5]:
def from_dob_to_age(born):
    today = datetime.date.today()
    return today.year - born.year - ((today.month, today.day) < (born.month, born.day))

In [6]:
age = df['DateOfBirth'].apply(lambda x: from_dob_to_age(x))

In [7]:
nrow = len(df)
AgeGroup = []
for i in range(0,nrow):
  if (age[i]>13 and age[i]<19):
    AgeGroup.append("Teen")
  elif (age[i]>=19 and age[i]<60):
    AgeGroup.append("Adult")
  elif (age[i]>=60):
    AgeGroup.append("Senior Adult")
  else:
    AgeGroup.append("N/A")

In [9]:
df["AgeGroup"] = AgeGroup

In [10]:
df

   ID        FullName  Gender DateOfBirth      AgeGroup
0   1      Stan Smith    Male  1960-02-10  Senior Adult
1   2  Nikola Griffin    Male  1999-12-20         Adult
2   3      Ruby Moore  Female  2002-03-03          Teen